src/InformationRegisters/РА_ПодсистемаРасчетаБонусовПартнеров_НастройкиНачисленияБонусовПартнерам/РА_ПодсистемаРасчетаБонусовПартнеров_НастройкиНачисленияБонусовПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_НастройкиНачисленияБонусовПартнерам</name>
  <resources>
    <name>НастройкаБонуснойПрграммы</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаПланЗакупок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаШоуРум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаСложныйПродукт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УидНастройки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложенияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриложенияКДоговору</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>DefinedType.РА_ПодсистемаРасчетаБонусовПартнеров_ОбъектыНастройкиБонуснойПрограммы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателяПлана</name>
    <type>
      <types>EnumRef.РА_ТипыПоказателяПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/РА_ТипыПоказателяПлана/РА_ТипыПоказателяПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РА_ТипыПоказателяПлана</name>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>НетПлана</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/РА_ПодсистемаРасчетаБонусовПартнеров_НастройкиНачисленияБонусовПартнерам/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Не ЗначениеЗаполнено(Запись.УидНастройки) Тогда
		Запись.УидНастройки = Новый УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПоказателяПланаПриИзменении(Элемент)
	УстановитьОформлениеФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКОмандФормы

&НаКлиенте
Процедура ОчиститьУид(Команда)
	Запись.УидНастройки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОформлениеФормы()

	Элементы.Валюта.Видимость = Запись.ТипПоказателяПлана = ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.Сумма");

	Если Запись.ТипПоказателяПлана = ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.Сумма") Тогда
		Элементы.ПоказательПлана.Заголовок = "Сумма (план)";
	Иначе
		Элементы.ПоказательПлана.Заголовок = "Количество (план)";
	КонецЕсли;
	
	Элементы.ПоказательПлана.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
	Элементы.ГруппаПланЗакупок.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
	Элементы.Производитель.Видимость = Запись.ТипПоказателяПлана <> ПредопределенноеЗначение("Перечисление.РА_ТипыПоказателяПлана.НетПлана");
		
КонецПроцедуры

#КонецОбласти
